ezois_ka/oooezoiskaobmen/src/AccumulationRegisters/РасчетыСПоставщикамиПоСрокам/РасчетыСПоставщикамиПоСрокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПоставщикамиПоСрокам</name>
  <resources>
    <name>Предоплата</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Долг</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДолгРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДолгУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПорядокЗачета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСПоставщиком</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.РегистраторРасчетов</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.РасчетКурсовыхРазниц</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВводОстатковДенежныхСредств</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.Сторно</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.ВводОстатковНДСПредъявленного</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктПремииПоставщика</types>
      <types>DocumentRef.ВводОстатковПоФинансовымИнструментам</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.ВводОстатковТоваров</types>
      <types>DocumentRef.ВводОстатковПрочиеРасходы</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
      <types>DocumentRef.ВводОстатковРасчетовПоЭквайрингу</types>
      <types>DocumentRef.ВводОстатковСПодотчетниками</types>
      <types>DocumentRef.ВводОстатковПрочихАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовПриемник</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерамПриемник</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПриемник</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПриемник</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДаннымОбъектаРасчетовИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаписиВзаиморасчетов</name>
    <type>
      <types>EnumRef.ТипыЗаписейВзаиморасчетов</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСПоставщиком</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПлановогоПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОплате</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Оплачивается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Отгружается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуКлиенту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажаПоЗаказу</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <comment>Заполняется для реализации товаров и услуг</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗалогЗаТару</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗачетаПоДатеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОплаты</name>
    <type>
      <types>EnumRef.ВариантыКонтроляОплатыКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовПриемник</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерамПриемник</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПриемник</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПриемник</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДаннымОбъектаРасчетовИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияВзаиморасчетов</name>
    <type>
      <types>EnumRef.ОперацииВзаиморасчетов</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen/src/AccumulationRegisters/РасчетыСПоставщикамиПоСрокам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОписаниеИсточника

// Заполняет параметры отражения движений регистра в финансовом учете
//
// Параметры:
//  МетаданныеРегистра - ОбъектМетаданныхРегистрНакопления - Метаданные регистра накопления
//  РегистрацияКОтражению - Булево - Признак получения параметров для регистрации к отражению в учете
//
// Возвращаемое значение:
// 	см. ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыОтраженияДвиженийВФинансовомУчете
//
Функция ПараметрыОтраженияДвиженийВФинансовомУчете(МетаданныеРегистра = Неопределено, РегистрацияКОтражению = Ложь) Экспорт
	
	ПараметрыОтражения = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыОтраженияДвиженийВФинансовомУчете(РегистрацияКОтражению);
	ПараметрыОтражения.ПутьКДаннымОрганизация = "АналитикаУчетаПоПартнерам.Организация";
	ПараметрыОтражения.ПутьКДаннымРегистратор = "ДокументРегистратор";
	
	Если РегистрацияКОтражению Тогда
		Возврат ПараметрыОтражения;
	КонецЕсли;
	
	ПараметрыОтражения.ВыделениеДолгосрочныхАктивовОбязательств = Истина;
	ПараметрыОтражения.ПутьКДаннымОбъектНастройки = "ОбъектРасчетов.ГруппаФинансовогоУчета";
	ПараметрыОтражения.ПутьКДаннымНаправлениеДеятельности = "АналитикаУчетаПоПартнерам.НаправлениеДеятельности";
	ПараметрыОтражения.ПутьКДаннымПодразделение = "ОбъектРасчетов.Подразделение";
	ПараметрыОтражения.ПутьКДаннымДатаПогашения = "ДатаПлановогоПогашения";
	ПараметрыОтражения.ПутьКДаннымВалюта = "Валюта";
	ПараметрыОтражения.РесурсыУпр.Добавить("ПредоплатаУпр");
	ПараметрыОтражения.РесурсыУпр.Добавить("ДолгУпр");
	ПараметрыОтражения.РесурсыРегл.Добавить("ПредоплатаРегл");
	ПараметрыОтражения.РесурсыРегл.Добавить("ДолгРегл");
	ПараметрыОтражения.РесурсыВал.Добавить("Предоплата");
	ПараметрыОтражения.РесурсыВал.Добавить("Долг");
	
	//++ НЕ УТ
	
	ПараметрыОтражения.ТипДанныхУчета = Перечисления.ТипыДанныхУчета.Контрагенты;
	ОпределитьПоказатели(ПараметрыОтражения);
	
	//-- НЕ УТ
	
	ПараметрыОтражения.УсловиеДебет = СтрЗаменить(
		"ВЫБОР
		|		КОГДА ПсевдонимИсточникаДанных.Долг <> 0
		|		  ИЛИ ПсевдонимИсточникаДанных.ДолгУпр <> 0
		|		  ИЛИ ПсевдонимИсточникаДанных.ДолгРегл <> 0
		|			ТОГДА ПсевдонимИсточникаДанных.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		КОГДА ПсевдонимИсточникаДанных.Предоплата <> 0
		|		  ИЛИ ПсевдонимИсточникаДанных.ПредоплатаУпр <> 0
		|		  ИЛИ ПсевдонимИсточникаДанных.ПредоплатаРегл <> 0
		|			ТОГДА ПсевдонимИсточникаДанных.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ",
		"ПсевдонимИсточникаДанных",
		ПараметрыОтражения.ПсевдонимИсточникаДанных);
	
	ПараметрыОтражения.УсловиеКредит = СтрЗаменить(
		"ВЫБОР
		|		КОГДА ПсевдонимИсточникаДанных.Долг <> 0
		|		  ИЛИ ПсевдонимИсточникаДанных.ДолгУпр <> 0
		|		  ИЛИ ПсевдонимИсточникаДанных.ДолгРегл <> 0
		|			ТОГДА ПсевдонимИсточникаДанных.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		КОГДА ПсевдонимИсточникаДанных.Предоплата <> 0
		|		  ИЛИ ПсевдонимИсточникаДанных.ПредоплатаУпр <> 0
		|		  ИЛИ ПсевдонимИсточникаДанных.ПредоплатаРегл <> 0
		|			ТОГДА ПсевдонимИсточникаДанных.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ",
		"ПсевдонимИсточникаДанных",
		ПараметрыОтражения.ПсевдонимИсточникаДанных);
	
	Если МетаданныеРегистра = Неопределено Тогда
		МетаданныеРегистра = СоздатьНаборЗаписей().Метаданные();
	КонецЕсли;
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ЗаполнитьПараметрыОтраженияПоМетаданнымРегистра(ПараметрыОтражения, МетаданныеРегистра);
	
	Возврат ПараметрыОтражения;
	
КонецФункции


//++ НЕ УТ

// Определяет показатели регистра.
//
// Параметры:
//  Свойства - Структура - содержащая ключи СвойстваПоказателей, СвойстваРесурсов
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя показателя.
//                 Значение - структура свойств показателя.
//
Функция Показатели(Свойства) Экспорт

	Показатели = Новый Соответствие;
	
	СвойстваПоказателей = Свойства.СвойстваПоказателей;
	СвойстваРесурсов = Свойства.СвойстваРесурсов;
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "ПредоплатаУпр", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "ПредоплатаРегл", "ВалютаРегл"));
    МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "Предоплата", "Валюта"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.Сумма, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	Возврат Показатели;
	
КонецФункции

//-- НЕ УТ

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ НЕ УТ

// Определяет показатели регистра
//
// Параметры:
//  ПараметрыОтражения - см. ПараметрыОтраженияДвиженийВФинансовомУчете()
//
Процедура ОпределитьПоказатели(ПараметрыОтражения)
	
	// Сумма предоплаты
	ПараметрыОтраженияПоказателя = Перечисления.ПоказателиАналитическихРегистров.ПараметрыОтраженияПоказателя();
	ПараметрыОтраженияПоказателя.РесурсыУпр.Добавить("ПредоплатаУпр");
	ПараметрыОтраженияПоказателя.РесурсыРегл.Добавить("ПредоплатаРегл");
	ПараметрыОтраженияПоказателя.РесурсыВал.Добавить("Предоплата");
	ПараметрыОтражения.Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаПредоплаты, ПараметрыОтраженияПоказателя);
	
	// Сумма постоплаты
	ПараметрыОтраженияПоказателя = Перечисления.ПоказателиАналитическихРегистров.ПараметрыОтраженияПоказателя();
	ПараметрыОтраженияПоказателя.РесурсыУпр.Добавить("ДолгУпр");
	ПараметрыОтраженияПоказателя.РесурсыРегл.Добавить("ДолгРегл");
	ПараметрыОтраженияПоказателя.РесурсыВал.Добавить("Долг");
	ПараметрыОтражения.Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаПостоплаты, ПараметрыОтраженияПоказателя);
	
КонецПроцедуры

//-- НЕ УТ

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.21.73";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1d87b923-d170-44ae-9550-190d1f7da828");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.Комментарий = СтрШаблон(НСтр("ru = 'Изменение операции ""Оплата самозанятому"" на операцию ""Оплата поставщику"".
		|Перезаполняет хозяйственную операцию для документа ""Взаимозачет задолженности"" с видом операции ""Перенос долга"",""Перенос аванса"".
		|Исправляет время проведения документов ""Бронирование"".
		|Заполнение реквизита ""%1""'"),
		Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.Реквизиты.ТипЗаписиВзаиморасчетов.Представление());
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра	= "РегистрНакопления.РасчетыСПоставщикамиПоСрокам";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	// Замена хозяйственной операции УдалитьОплатаСамозанятому
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияРегистра.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК ДвиженияРегистра
	|ГДЕ
	|	ДвиженияРегистра.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УдалитьОплатаСамозанятому)
	|
	// Взаимозачеты задолженности
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщикамиПоСрокам.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|ГДЕ
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|		И ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДокументРегистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОпераций)
	|		И РасчетыСПоставщикамиПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|
	// Исправить время движений документов ""Бронирование""
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Бронирование КАК Бронирование
	|	ПО Расчеты.ДокументРегистратор = Бронирование.Ссылка
	|ГДЕ
	|	ГОД(Расчеты.Период) = ГОД(Бронирование.Дата)
	|	И МЕСЯЦ(Расчеты.Период) = МЕСЯЦ(Бронирование.Дата)
	|	И ДЕНЬ(Расчеты.Период) = ДЕНЬ(Бронирование.Дата)
	|	И (ЧАС(Расчеты.Период) <> ЧАС(Бронирование.Дата)
	|		ИЛИ МИНУТА(Расчеты.Период) <> МИНУТА(Бронирование.Дата)
	|		ИЛИ СЕКУНДА(Расчеты.Период) <> СЕКУНДА(Бронирование.Дата))
	|
	// Типы записей взаиморасчетов 
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщикамиПоСрокам.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|ГДЕ
	|	РасчетыСПоставщикамиПоСрокам.ТипЗаписиВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейВзаиморасчетов.ПустаяСсылка)
	|";
	Запрос.УстановитьПараметр("ВидыОпераций", РегистрыНакопления.РасчетыСКлиентами.ВидыОпераций());
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам;
	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = НЕ ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
		Если Параметры.ОбработкаЗавершена
			И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя())
			И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя())
			И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя()) Тогда
			Константы.УдалитьТипыЗаписейВзаиморасчетовЗаполнены.Установить(Истина);
		КонецЕсли;
		Возврат;
	КонецЕсли;//есть данные к обновлению
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоСрокам.ДокументРегистратор КАК ДокументРегистратор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетыПоСрокам.Регистратор) КАК ВсегоОбъектовРасчетов
	|ПОМЕСТИТЬ втНесколькоОбъектовРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|ГДЕ
	|	РасчетыПоСрокам.Регистратор В (&Регистраторы)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоСрокам.ДокументРегистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокам.ДокументРегистратор
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетыПоСрокам.Регистратор) > 1
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПоСрокам.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РасчетыПоСрокам.Регистратор) КАК Представление,
	|	РасчетыПоСрокам.ДокументРегистратор КАК ДокументРегистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНесколькоОбъектовРасчетов КАК НесколькоОбъектовРасчетов
	|	ПО РасчетыПоСрокам.ДокументРегистратор = НесколькоОбъектовРасчетов.ДокументРегистратор
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПоСрокам.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РасчетыПоСрокам.Регистратор) КАК Представление,
	|	НЕОПРЕДЕЛЕНО КАК ДокументРегистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|	ЛЕВОЕ СОЕДИНЕНИЕ втНесколькоОбъектовРасчетов КАК НесколькоОбъектовРасчетов
	|	ПО РасчетыПоСрокам.ДокументРегистратор = НесколькоОбъектовРасчетов.ДокументРегистратор
	|ГДЕ
	|	РасчетыПоСрокам.Регистратор В (&Регистраторы)
	|	И НесколькоОбъектовРасчетов.ДокументРегистратор ЕСТЬ NULL
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ДокументРегистратор УБЫВ,
	|	Регистратор УБЫВ
	|	
	|ИТОГИ ПО
	|	ДокументРегистратор
	|;
	|
	
	// Вспомогательные данные для обновления
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.ДокументРегистратор КАК Взаимозачет
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Движения
	|ГДЕ
	|	Движения.Регистратор В (&Регистраторы)
	|	И ВЫРАЗИТЬ(Движения.ДокументРегистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОперацийПоДолгу)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.ДокументРегистратор КАК Взаимозачет
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Движения
	|ГДЕ
	|	Движения.Регистратор В (&Регистраторы)
	|	И ВЫРАЗИТЬ(Движения.ДокументРегистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОперацийПоАвансу)
	|;
	|
	// Документы основания Сторно
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.ДокументРегистратор КАК ДокументРегистратор,
	|	ДанныеСторно.СторнируемыйДокумент КАК СторнируемыйДокумент
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Движения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДанныеСторно
	|		ПО Движения.ДокументРегистратор = ДанныеСторно.Ссылка
	|ГДЕ
	|	Движения.Регистратор В (&Регистраторы)
	|";
	Запрос.УстановитьПараметр("Регистраторы", ОбновляемыеДанные.ВыгрузитьКолонку("Регистратор"));
	Запрос.УстановитьПараметр("ВидыОперацийПоДолгу", РегистрыНакопления.РасчетыСКлиентами.ВидыОперацийПоДолгу());
	Запрос.УстановитьПараметр("ВидыОперацийПоАвансу", РегистрыНакопления.РасчетыСКлиентами.ВидыОперацийПоАвансу());
	Результаты = Запрос.ВыполнитьПакет();
	ПоследнийИндекс = Результаты.ВГраница();
	
	ВыборкаПоДокументуРегистратору = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НастройкаХозяйственнойОперации = 
		Справочники.НастройкиХозяйственныхОпераций.НайтиПоРеквизиту("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	НеИспользуемаяНастройкаОперации = 
		Справочники.НастройкиХозяйственныхОпераций.НайтиПоРеквизиту("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.УдалитьОплатаСамозанятому);
	
	ВспомогательныеДанные = Новый Структура;
	ВспомогательныеДанные.Вставить("НастройкаХозяйственнойОперации", НастройкаХозяйственнойОперации);
	ВспомогательныеДанные.Вставить("НеИспользуемаяНастройкаОперации", НеИспользуемаяНастройкаОперации);
	ВспомогательныеДанные.Вставить("ДанныеЗаменыОперации", РегистрыНакопления.РасчетыСКлиентами.ДанныеЗаменыОперации());
	
	ВспомогательныеДанные.Вставить("ВзаимозачетПереносДолга", Результаты[ПоследнийИндекс-2].Выгрузить().ВыгрузитьКолонку("Взаимозачет"));
	ВспомогательныеДанные.Вставить("ВзаимозачетПереносАванса", Результаты[ПоследнийИндекс-1].Выгрузить().ВыгрузитьКолонку("Взаимозачет"));
	СторнируемыеДокументы = Результаты[ПоследнийИндекс].Выгрузить();
	СторнируемыеДокументы.Индексы.Добавить("ДокументРегистратор");
	ВспомогательныеДанные.Вставить("СторнируемыеДокументы", СторнируемыеДокументы);
	
	Регистраторы = Новый ТаблицаЗначений;
	Регистраторы.Колонки.Добавить("Регистратор");
	Регистраторы.Колонки.Добавить("Представление");
	Пока ВыборкаПоДокументуРегистратору.Следующий() Цикл
		
		ВыборкаПоРегистратору = ВыборкаПоДокументуРегистратору.Выбрать();
		Если ЗначениеЗаполнено(ВыборкаПоДокументуРегистратору.ДокументРегистратор) Тогда
			
			ДокументРегистратор = ВыборкаПоДокументуРегистратору.ДокументРегистратор;
			//связанные регистраторы обновляем в одной транзакции
			НачатьТранзакцию();
			Попытка
				ПричинаИсключения = "Блокировка";
				#Область Блокировки
				Регистраторы.Очистить();
				Пока ВыборкаПоРегистратору.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(Регистраторы.Добавить(),ВыборкаПоРегистратору);
				КонецЦикла;
				ВыборкаПоРегистратору.Сбросить();
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщикамиПоСрокам.НаборЗаписей");
				ЭлементБлокировки.ИсточникДанных = Регистраторы;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				Блокировка.Заблокировать();
				#КонецОбласти
			
				ПричинаИсключения = "ПлохиеДанные";
				Пока ВыборкаПоРегистратору.Следующий() Цикл
					
					ПроблемныйРегистратор = ВыборкаПоРегистратору.Регистратор;
					НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Регистратор.Установить(ПроблемныйРегистратор);
					НаборЗаписей.Прочитать();
					
					ОбработкаДвиженийНабораЗаписей(НаборЗаписей, ВспомогательныеДанные);
					
				КонецЦикла;
				ЗафиксироватьТранзакцию();
			Исключение
				
				ОтменитьТранзакцию();
				Если ПричинаИсключения = "ПлохиеДанные" Тогда
					ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ДокументРегистратор);
					Если ЗначениеЗаполнено(ДокументРегистратор) Тогда
						ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
						ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
							ДокументРегистратор,
							РегистрыНакопления.РасчетыСКлиентами.ТекстСообщенияОбОшибке(ИнформацияОбОшибке(), ДокументРегистратор)
							+ Символы.ПС + РегистрыНакопления.РасчетыСКлиентами.ТекстПерепроведитеДокументВРучную());
					КонецЕсли;
				КонецЕсли;
					
			КонецПопытки;
			
		Иначе//независимые регистраторы обновляем каждый в своей транзакции
			
			Пока ВыборкаПоРегистратору.Следующий() Цикл
				
				ПроблемныйРегистратор = ВыборкаПоРегистратору.Регистратор;
				ПредставлениеРегистратора = ВыборкаПоРегистратору.Представление;
				
				НачатьТранзакцию();
				Попытка
					
					ПричинаИсключения = "Блокировка";
					#Область Блокировки
					Блокировка = Новый БлокировкаДанных;
					ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщикамиПоСрокам.НаборЗаписей");
					ЭлементБлокировки.УстановитьЗначение("Регистратор", ПроблемныйРегистратор);
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
					Блокировка.Заблокировать();
					#КонецОбласти
					
					НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Регистратор.Установить(ПроблемныйРегистратор);
					НаборЗаписей.Прочитать();
					
					ПричинаИсключения = "ПлохиеДанные";
					ОбработкаДвиженийНабораЗаписей(НаборЗаписей, ВспомогательныеДанные);
					
					ЗафиксироватьТранзакцию();
				Исключение
					
					ОтменитьТранзакцию();
					Если ПричинаИсключения = "ПлохиеДанные" Тогда
						ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ПроблемныйРегистратор, ПредставлениеРегистратора);
						Если ЗначениеЗаполнено(ПроблемныйРегистратор) Тогда
							ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
							ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
								ПроблемныйРегистратор,
								РегистрыНакопления.РасчетыСКлиентами.ТекстСообщенияОбОшибке(ИнформацияОбОшибке(), ПредставлениеРегистратора));
						КонецЕсли;
					КонецЕсли;
					
				КонецПопытки;
				
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЦикла;//по документу регистратору
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	Если Параметры.ОбработкаЗавершена
		И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя())
		И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя())
		И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя()) Тогда
		Константы.УдалитьТипыЗаписейВзаиморасчетовЗаполнены.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаДвиженийНабораЗаписей(НаборЗаписей, ДополнительныеПараметры)
	
	НастройкаХозяйственнойОперации = ДополнительныеПараметры.НастройкаХозяйственнойОперации;
	НеИспользуемаяНастройкаОперации = ДополнительныеПараметры.НеИспользуемаяНастройкаОперации;
	ВзаимозачетПереносДолга = ДополнительныеПараметры.ВзаимозачетПереносДолга;
	ВзаимозачетПереносАванса = ДополнительныеПараметры.ВзаимозачетПереносАванса;
	ДанныеЗаменыОперации = ДополнительныеПараметры.ДанныеЗаменыОперации;
	СторнируемыеДокументы = ДополнительныеПараметры.СторнируемыеДокументы;
	
	КэшРеквизитов = Новый Соответствие;
	Для Каждого Запись Из НаборЗаписей Цикл
		
		#Область ЗаменаОперацииУдалитьОплатаСамозанятому
		Если Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдалитьОплатаСамозанятому Тогда
			Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
			Если ЗначениеЗаполнено(Запись.НастройкаХозяйственнойОперации)
				И Запись.НастройкаХозяйственнойОперации = НеИспользуемаяНастройкаОперации Тогда
				Запись.НастройкаХозяйственнойОперации = НастройкаХозяйственнойОперации;
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти
		
		#Область ЗаменаОперацииВзаимозачетЗадолженности
		Если Запись.ХозяйственнаяОперация = ДанныеЗаменыОперации.ОперацияВзаимозачет
			ИЛИ Запись.НастройкаХозяйственнойОперации = ДанныеЗаменыОперации.НастройкаВзаимозачет Тогда
			Если ВзаимозачетПереносДолга.Найти(Запись.ДокументРегистратор) <> Неопределено Тогда
				Запись.ХозяйственнаяОперация = ДанныеЗаменыОперации.ОперацияПереносДолга;
				Запись.НастройкаХозяйственнойОперации = ДанныеЗаменыОперации.НастройкаПереносДолга;
			ИначеЕсли ВзаимозачетПереносАванса.Найти(Запись.ДокументРегистратор) <> Неопределено Тогда
				Запись.ХозяйственнаяОперация = ДанныеЗаменыОперации.ОперацияПереносАванса;
				Запись.НастройкаХозяйственнойОперации = ДанныеЗаменыОперации.НастройкаПереносАванса;
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти
		
		#Область ИсправлениеВремениОперацииБронирования
		Если ТипЗнч(Запись.ДокументРегистратор) = Тип("ДокументСсылка.Бронирование") Тогда
			ДатаДокумента = КэшРеквизитов[Запись.ДокументРегистратор];
			Если ДатаДокумента = Неопределено Тогда
				ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ДокументРегистратор, "Дата");
				КэшРеквизитов.Вставить(Запись.ДокументРегистратор, ДатаДокумента);
			КонецЕсли;
			РегистрыНакопления.РасчетыСПоставщиками.ПроверитьИУстановитьВремяПериодаЗаписи(Запись, ДатаДокумента)
		КонецЕсли;
		#КонецОбласти
		
		#Область ЗаполнениеТиповЗаписейВзаиморасчетов
		Если Не ЗначениеЗаполнено(Запись.ТипЗаписиВзаиморасчетов) Тогда
			ТипРегистратора = ТипЗнч(Запись.ДокументРегистратор);
			Если ТипРегистратора = Тип("ДокументСсылка.Сторно") Тогда 
				СтрокаСторнируемогоДокумента = СторнируемыеДокументы.Найти(Запись.ДокументРегистратор, "ДокументРегистратор");
				Если СтрокаСторнируемогоДокумента <> Неопределено Тогда
					ТипРегистратора = ТипЗнч(СтрокаСторнируемогоДокумента.СторнируемыйДокумент);
				КонецЕсли;
			КонецЕсли;
			ОперативныеВзаиморасчетыСервер.ЗаполнитьТипЗаписиВзаиморасчетов(Запись, ТипРегистратора);
		КонецЕсли;
		#КонецОбласти
		
	КонецЦикла;
	
	ИзменилисьИтоги = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		ИзменилисьИтоги = РегистрыНакопления.РасчетыСКлиентами.ЕстьИзмененияИтоговНабора(НаборЗаписей);
	КонецЕсли;
	Если НаборЗаписей.Модифицированность() И НЕ ИзменилисьИтоги Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	Иначе
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
